<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# SQL Exam

## Instructions to students

This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good luck!_**

## The TMDb database

In this supplementary exam, you will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment.  You can do this by loading the magic command `%load_ext sql`.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file from Athena and have stored it in a known location.

In [8]:
!pip install sqlalchemy pandas

Requirement already satisfied: sqlalchemy in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (2.0.43)
Requirement already satisfied: pandas in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (2.3.3)
Requirement already satisfied: greenlet>=1 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\zak\anaconda3\envs\creating_an_environment\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [50]:
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect("TMDB-a-4006.db")

# Optional: create a cursor
cursor = conn.cursor()

In [13]:
# List tables
tables = pd.read_sql("SELECT  * FROM movies;", conn)
print(tables)

      movie_id                        title                release_date  \
0            5                   Four Rooms  1995-12-09 00:00:00.000000
1           11                    Star Wars  1977-05-25 00:00:00.000000
2           12                 Finding Nemo  2003-05-30 00:00:00.000000
3           13                 Forrest Gump  1994-07-06 00:00:00.000000
4           14              American Beauty  1999-09-15 00:00:00.000000
...        ...                          ...                         ...
4798    426067             Midnight Cabaret  1990-01-01 00:00:00.000000
4799    426469             Growing Up Smith  2017-02-03 00:00:00.000000
4800    433715                       8 Days  2014-06-15 00:00:00.000000
4801    447027              Running Forever  2015-10-27 00:00:00.000000
4802    459488  To Be Frank, Sinatra at 100  2015-12-12 00:00:00.000000

        budget                                           homepage  \
0      4000000                                               None
1     11000000  http://www.starwars.com/films/star-wars-episod...
2     94000000              http://movies.disney.com/finding-nemo
3     55000000                                               None
4     15000000                      http://www.dreamworks.com/ab/
...        ...                                                ...
4798         0                                               None
4799         0                 http://www.growingupsmithmovie.com
4800         0                                               None
4801         0                                               None
4802         2                                               None

     original_language               original_title  \
0                   en                   Four Rooms
1                   en                    Star Wars
2                   en                 Finding Nemo
3                   en                 Forrest Gump
4                   en              American Beauty
...                ...                          ...
4798                en             Midnight Cabaret
4799                en             Growing Up Smith
4800                en                       8 Days
4801                en              Running Forever
4802                en  To Be Frank, Sinatra at 100

                                               overview  popularity  \
0     It's Ted the Bellhop's first night on the job....   22.876230
1     Princess Leia is captured and held hostage by ...  126.393695
2     Nemo, an adventurous young clownfish, is unexp...   85.688789
3     A man with a low IQ has accomplished great thi...  138.133331
4     Lester Burnham, a depressed suburban father in...   80.878605
...                                                 ...         ...
4798  A Broadway producer puts on a play with a Devi...    0.001389
4799  "In 1979, an Indian family moves to America wi...    0.710870
4800  After sneaking to a party with her friends, 16...    0.015295
4801  After being estranged since her mother's death...    0.028756
4802                                               None    0.050625

          revenue  runtime release_status  \
0       4300000.0     98.0       Released
1     775398007.0    121.0       Released
2     940335536.0    100.0       Released
3     677945399.0    142.0       Released
4     356296601.0    122.0       Released
...           ...      ...            ...
4798          0.0     94.0       Released
4799          0.0    102.0       Released
4800          0.0     90.0       Released
4801          0.0     88.0       Released
4802          0.0      NaN       Released

                                                tagline  vote_average  \
0     Twelve outrageous guests. Four scandalous requ...           6.5
1          A long time ago in a galaxy far, far away...           8.1
2     There are 3.7 trillion fish in the ocean, they...           7.6
3     The world will never be the same, once you've ...           8.2
4                                          Look closer.           7.9
...                                                 ...           ...
4798                The hot spot where Satan's waitin'.           0.0
4799           ItÆs better to stand out than to fit in.           7.4
4800           She never knew it could happen to her...           0.0
4801                                               None           0.0
4802                                               None           0.0

      vote_count
0            530
1           6624
2           6122
3           7927
4           3313
...          ...
4798           0
4799           7
4800           0
4801           0
4802           0

[4803 rows x 15 columns]

In [7]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

If the above line didn't throw out any errors, then you should be good to go. Good luck with the exam!

## Questions on SQL

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided. Your solution should match one of the multiple-choice questions on Athena.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

(Hint: The winner is indicated as '1.0'.)

**Options:** 

  - Micheal Fassbender
  - Natalie Portman
  - Leonardo DiCaprio
  - Eddie Redmayne

In [24]:
# List tables
tables = pd.read_sql("SELECT * FROM oscars WHERE year = '2015' AND award LIKE '%Actor in a Leading Role%' AND winner = '1.0';", conn)

print(tables)

   year                    award winner               name          film
0  2015  Actor in a Leading Role    1.0  Leonardo DiCaprio  The Revenant

In [21]:
# List tables
tables = pd.read_sql("SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10;", conn)
print(tables)

   movie_id                  title                release_date    budget  \
0      3059            Intolerance  1916-09-04 00:00:00.000000    385907
1      3060         The Big Parade  1925-11-05 00:00:00.000000    245000
2        19             Metropolis  1927-01-10 00:00:00.000000  92620000
3       905          Pandora's Box  1929-01-30 00:00:00.000000         0
4     65203    The Broadway Melody  1929-02-08 00:00:00.000000    379000
5     22301          Hell's Angels  1930-11-15 00:00:00.000000   3950000
6     22649     A Farewell to Arms  1932-12-08 00:00:00.000000         4
7      3062            42nd Street  1933-02-02 00:00:00.000000    439000
8     43595     She Done Him Wrong  1933-02-09 00:00:00.000000    200000
9      3078  It Happened One Night  1934-02-22 00:00:00.000000    325000

  homepage original_language          original_title  \
0     None                en             Intolerance
1     None                en          The Big Parade
2     None                de              Metropolis
3     None                de  Die Bnchse der Pandora
4     None                en     The Broadway Melody
5     None                en           Hell's Angels
6     None                en      A Farewell to Arms
7     None                en             42nd Street
8     None                en      She Done Him Wrong
9     None                en   It Happened One Night

                                            overview  popularity     revenue  \
0  The story of a poor young woman, separated by ...    3.232447   8394751.0
1  The story of an idle rich boy who joins the US...    0.785744  22000000.0
2  In a futuristic city sharply divided between t...   32.351527    650422.0
3  The rise and inevitable fall of an amoral but ...    1.824184         0.0
4  Harriet and Queenie Mahoney, a vaudeville act,...    0.968865   4358000.0
5  Two brothers attending Oxford enlist with the ...    8.484123   8000000.0
6  British nurse Catherine Barkley (Helen Hayes) ...    1.199451        25.0
7  A producer puts on what may be his last Broadw...    1.933366   2281000.0
8  "New York singer and nightclub owner Lady Lou ...    0.622752   2200000.0
9  Ellie Andrews has just tied the knot with soci...   11.871424   4500000.0

   runtime release_status                                            tagline  \
0    197.0       Released                      The Cruel Hand of Intolerance
1    151.0       Released                                               None
2    153.0       Released  There can be no understanding between the hand...
3    109.0       Released                                               None
4    100.0       Released  The pulsating drama of Broadway's bared heart ...
5    127.0       Released  Howard Hughes' Thrilling Multi-Million Dollar ...
6     89.0       Released          Every woman who has loved will understand
7     89.0       Released                                               None
8     66.0       Released         Mae West gives a 'Hot Time' to the nation!
9    105.0       Released                     TOGETHER... for the first time

   vote_average  vote_count
0           7.4          60
1           7.0          21
2           8.0         657
3           7.6          45
4           5.0          19
5           6.1          19
6           6.2          28
7           6.1          37
8           5.1          27
9           7.7         275

### Question 2

What query will produce the ten oldest movies in the database?

**Options:**

 - SELECT TOP(10) * FROM movies WHERE release_date ORDER BY release_date ASC

 - SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10

 - SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

 -  SELECT * FROM movies WHERE release_date IS NULL ORDER BY release_date DESC LIMIT 10

In [113]:
%%sql
# Add your code here
tables = pd.read_sql("SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10;", conn)
print(tables)

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [114]:
tables = pd.read_sql("SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10;", conn)

print(tables)

   movie_id                  title                release_date    budget  \
0      3059            Intolerance  1916-09-04 00:00:00.000000    385907
1      3060         The Big Parade  1925-11-05 00:00:00.000000    245000
2        19             Metropolis  1927-01-10 00:00:00.000000  92620000
3       905          Pandora's Box  1929-01-30 00:00:00.000000         0
4     65203    The Broadway Melody  1929-02-08 00:00:00.000000    379000
5     22301          Hell's Angels  1930-11-15 00:00:00.000000   3950000
6     22649     A Farewell to Arms  1932-12-08 00:00:00.000000         4
7      3062            42nd Street  1933-02-02 00:00:00.000000    439000
8     43595     She Done Him Wrong  1933-02-09 00:00:00.000000    200000
9      3078  It Happened One Night  1934-02-22 00:00:00.000000    325000

  homepage original_language          original_title  \
0     None                en             Intolerance
1     None                en          The Big Parade
2     None                de              Metropolis
3     None                de  Die Bnchse der Pandora
4     None                en     The Broadway Melody
5     None                en           Hell's Angels
6     None                en      A Farewell to Arms
7     None                en             42nd Street
8     None                en      She Done Him Wrong
9     None                en   It Happened One Night

                                            overview  popularity     revenue  \
0  The story of a poor young woman, separated by ...    3.232447   8394751.0
1  The story of an idle rich boy who joins the US...    0.785744  22000000.0
2  In a futuristic city sharply divided between t...   32.351527    650422.0
3  The rise and inevitable fall of an amoral but ...    1.824184         0.0
4  Harriet and Queenie Mahoney, a vaudeville act,...    0.968865   4358000.0
5  Two brothers attending Oxford enlist with the ...    8.484123   8000000.0
6  British nurse Catherine Barkley (Helen Hayes) ...    1.199451        25.0
7  A producer puts on what may be his last Broadw...    1.933366   2281000.0
8  "New York singer and nightclub owner Lady Lou ...    0.622752   2200000.0
9  Ellie Andrews has just tied the knot with soci...   11.871424   4500000.0

   runtime release_status                                            tagline  \
0    197.0       Released                      The Cruel Hand of Intolerance
1    151.0       Released                                               None
2    153.0       Released  There can be no understanding between the hand...
3    109.0       Released                                               None
4    100.0       Released  The pulsating drama of Broadway's bared heart ...
5    127.0       Released  Howard Hughes' Thrilling Multi-Million Dollar ...
6     89.0       Released          Every woman who has loved will understand
7     89.0       Released                                               None
8     66.0       Released         Mae West gives a 'Hot Time' to the nation!
9    105.0       Released                     TOGETHER... for the first time

   vote_average  vote_count
0           7.4          60
1           7.0          21
2           8.0         657
3           7.6          45
4           5.0          19
5           6.1          19
6           6.2          28
7           6.1          37
8           5.1          27
9           7.7         275

### Question 3

How many unique awards are there in the Oscars table?

**Options:**
 - 141
 - 53 
 - 80
 - 114

In [33]:
tables = pd.read_sql("SELECT COUNT(DISTINCT award) AS unique_awards FROM oscars;", conn)

print(tables)

   unique_awards
0            114

### Question 4

How many movies are there that contain the word “Spider” within their title?

**Options:**
 - 0
 - 5
 - 1
 - 9

In [36]:
%%sql
# Add your code here
tables = pd.read_sql("SELECT COUNT(*) AS count FROM movies WHERE title LIKE '%Spider%';", conn)
print(tables)

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [37]:
tables = pd.read_sql("SELECT COUNT(*) AS count FROM movies WHERE title LIKE '%Spider%';", conn)

print(tables)

   count
0      9

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?


**Options:**
 - 48
 - 38
 - 14
 - 1

In [55]:
pd.read_sql("PRAGMA table_info(genremap);", conn)

   cid      name     type  notnull dflt_value  pk
0    0  movie_id  INTEGER        1       None   1
1    1  genre_id  INTEGER        1       None   2

In [56]:
tables = pd.read_sql("""
SELECT COUNT(*) AS count
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

print(tables)

   count
0     55

In [57]:
tables = pd.read_sql("""
SELECT COUNT(*) AS count
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

print(tables)

   count
0     55

In [58]:
pd.read_sql("""
SELECT COUNT(DISTINCT m.movie_id) AS unique_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

   unique_movies
0             48

In [59]:
pd.read_sql("""
SELECT movie_id, COUNT(*) AS cnt
FROM keywordmap
GROUP BY movie_id
HAVING cnt > 10;
""", conn)

      movie_id  cnt
0           11   16
1           12   12
2           13   19
3           14   21
4           16   29
...        ...  ...
1241    328111   11
1242    328387   13
1243    332567   12
1244    334074   14
1245    335778   12

[1246 rows x 2 columns]

In [60]:
pd.read_sql("""
SELECT COUNT(DISTINCT m.movie_id) AS unique_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

   unique_movies
0             48

In [39]:
pd.read_sql("PRAGMA table_info(genres);", conn)

   cid        name         type  notnull dflt_value  pk
0    0    genre_id      INTEGER        1       None   1
1    1  genre_name  varchar(50)        0       NULL   0

In [47]:
pd.read_sql("PRAGMA table_info(keywords);", conn)

   cid          name          type  notnull dflt_value  pk
0    0    keyword_id       INTEGER        1       None   1
1    1  keyword_name  varchar(500)        0       NULL   0

In [61]:
pd.read_sql("""
SELECT COUNT(DISTINCT m.movie_id) AS unique_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

   unique_movies
0             48

In [62]:
pd.read_sql("""
SELECT COUNT(DISTINCT m.movie_id) AS unique_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

   unique_movies
0             48

In [63]:
pd.read_sql("""
SELECT COUNT(DISTINCT m.movie_id) AS unique_movies
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
JOIN keywordmap km ON m.movie_id = km.movie_id
JOIN keywords k ON km.keyword_id = k.keyword_id
WHERE g.genre_name = 'Thriller'
  AND k.keyword_name LIKE '%love%';
""", conn)

   unique_movies
0             48

In [64]:
%%sql
# Add your code here

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

 
**Options:**

 - 29
 - 23
 - 28
 - 35

In [65]:
tables = pd.read_sql("""
SELECT COUNT(*) AS count
FROM movies
WHERE release_date BETWEEN '2006-08-01' AND '2009-10-01'
  AND popularity > 40
  AND budget < 50000000;
""", conn)

print(tables)

   count
0     29

In [ ]:
%%sql
# Add your code here

### Question 7

How many unique characters has "Vin Diesel" played so far in the database?

**Options:**
 - 24
 - 19
 - 18
 - 16

In [73]:
tables = pd.read_sql("""
SELECT COUNT(DISTINCT c.characters) AS unique_characters
FROM casts c
JOIN actors a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Vin Diesel';
""", conn)

print(tables)

   unique_characters
0                 16

In [71]:
tables = pd.read_sql("PRAGMA table_info(actors);", conn)
print(tables)

   cid        name          type  notnull dflt_value  pk
0    0    actor_id       INTEGER        1       None   1
1    1  actor_name  varchar(100)        0       NULL   0
2    2      gender       INTEGER        0       NULL   0

In [72]:
tables = pd.read_sql("""
SELECT COUNT(DISTINCT c.characters) AS unique_characters
FROM casts c
JOIN actors a ON c.actor_id = a.actor_id
WHERE a.actor_name = 'Vin Diesel';
""", conn)

print(tables)

   unique_characters
0                 16

In [68]:
tables = pd.read_sql("PRAGMA table_info(casts);", conn)
print(tables)

   cid        name          type  notnull dflt_value  pk
0    0    movie_id       INTEGER        1       None   1
1    1    actor_id       INTEGER        1       None   2
2    2  characters  varchar(500)        1       None   3

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?


**Options:**
 - Action, Romance
 - Drama, Comedy
 - Crime, Thriller
 - Drama, Romance

In [84]:
import pandas as pd

tables = pd.read_sql("""
SELECT g.genre_name
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
WHERE m.title = 'The Royal Tenenbaums';
""", conn)

print(tables)

  genre_name
0      Drama
1     Comedy

In [79]:
tables = pd.read_sql("PRAGMA table_info(movies);", conn)
print(tables)

    cid               name           type  notnull dflt_value  pk
0     0           movie_id        INTEGER        1       None   1
1     1              title   varchar(500)        0       NULL   0
2     2       release_date    datetime(6)        0       NULL   0
3     3             budget        INTEGER        0       NULL   0
4     4           homepage   varchar(500)        0       NULL   0
5     5  original_language    varchar(50)        0       NULL   0
6     6     original_title   varchar(500)        0       NULL   0
7     7           overview  varchar(5000)        0       NULL   0
8     8         popularity         double        0       NULL   0
9     9            revenue         double        0       NULL   0
10   10            runtime         double        0       NULL   0
11   11     release_status    varchar(50)        0       NULL   0
12   12            tagline   varchar(500)        0       NULL   0
13   13       vote_average         double        0       NULL   0
14   14         vote_count        INTEGER        0       NULL   0

In [83]:
import pandas as pd

# Assuming conn is your database connection
pd.read_sql("PRAGMA table_info(genremap);", conn)

   cid      name     type  notnull dflt_value  pk
0    0  movie_id  INTEGER        1       None   1
1    1  genre_id  INTEGER        1       None   2

In [85]:
import pandas as pd

tables = pd.read_sql("""
SELECT g.genre_name
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
WHERE m.title = 'The Royal Tenenbaums';
""", conn)

print(tables)

  genre_name
0      Drama
1     Comedy

In [76]:
tables = pd.read_sql("PRAGMA table_info(genres);", conn)
print(tables)

   cid        name         type  notnull dflt_value  pk
0    0    genre_id      INTEGER        1       None   1
1    1  genre_name  varchar(50)        0       NULL   0

### Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?


**Options:**

 - MCL Films S.A., Turner Pictures, and George Stevens Productions
 - The Donners' Company, Bulletproof Cupid, and Kinberg Genre
 - Bulletproof Cupid, The Donners' Company, and MCL Films S.A
 - B.Sting Entertainment, Illumination Pictures, and Aztec Musique

In [86]:
SELECT pc.name AS production_company, AVG(m.popularity) AS avg_popularity
FROM movies m
JOIN production_companies_map pcm ON m.movie_id = pcm.movie_id
JOIN production_companies pc ON pcm.company_id = pc.company_id
GROUP BY pc.name
ORDER BY avg_popularity DESC
LIMIT 3;

SyntaxError: invalid syntax (886129013.py, line 1)

In [87]:
%%sql
# Add your code here
pd.read_sql("PRAGMA table_info(production_companies_map);", conn)

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [88]:
pd.read_sql("PRAGMA table_info(production_companies_map);", conn)

Empty DataFrame
Columns: [cid, name, type, notnull, dflt_value, pk]
Index: []

In [89]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

                    name
0                 actors
1                  casts
2               genremap
3                 genres
4             keywordmap
5               keywords
6            languagemap
7              languages
8                 movies
9                 oscars
10   productioncompanies
11  productioncompanymap
12   productioncountries
13  productioncountrymap
14           sysdiagrams

In [90]:
pd.read_sql("PRAGMA table_info(production_companies);", conn)
pd.read_sql("PRAGMA table_info(production_companies_map);", conn)

Empty DataFrame
Columns: [cid, name, type, notnull, dflt_value, pk]
Index: []

In [95]:
import pandas as pd

# Show the schema of the productioncompanies table
pd.read_sql("PRAGMA table_info(productioncompanies);", conn)

   cid                     name          type  notnull dflt_value  pk
0    0    production_company_id       INTEGER        1       None   1
1    1  production_company_name  varchar(500)        0       NULL   0

In [97]:
import pandas as pd

# Check schema of productioncompanymap
pd.read_sql("PRAGMA table_info(productioncompanymap);", conn)

   cid                   name     type  notnull dflt_value  pk
0    0               movie_id  INTEGER        1       None   1
1    1  production_company_id  INTEGER        1       None   2

In [98]:
import pandas as pd

query = """
SELECT pc.production_company_name AS production_company, AVG(m.popularity) AS avg_popularity
FROM movies m
JOIN productioncompanymap pcm ON m.movie_id = pcm.movie_id
JOIN productioncompanies pc ON pcm.production_company_id = pc.production_company_id
GROUP BY pc.production_company_name
ORDER BY avg_popularity DESC
LIMIT 3;
"""

top_companies = pd.read_sql(query, conn)
print(top_companies)

     production_company  avg_popularity
0  The Donners' Company      514.569956
1     Bulletproof Cupid      481.098624
2         Kinberg Genre      326.920999

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?


**Options:**

 - 0
 - 355
 - 7335
 - 1949

In [101]:
import pandas as pd

# Show schema of the actors table
pd.read_sql("PRAGMA table_info(actors);", conn)

   cid        name          type  notnull dflt_value  pk
0    0    actor_id       INTEGER        1       None   1
1    1  actor_name  varchar(100)        0       NULL   0
2    2      gender       INTEGER        0       NULL   0

In [102]:
import pandas as pd

query = """
SELECT COUNT(*) AS female_actors_count
FROM actors
WHERE gender = 1
  AND actor_name LIKE 'N%';
"""

result = pd.read_sql(query, conn)
print(result)

   female_actors_count
0                  355

In [ ]:
%%sql
# Add your code here

### Question 11

Which genre has, on average, the lowest movie popularity score? 


**Options:**

 - Science Fiction
 - Animation
 - Documentary
 - Foreign

In [104]:
import pandas as pd

query = """
SELECT g.genre_name, AVG(m.popularity) AS avg_popularity
FROM movies m
JOIN genremap gm ON m.movie_id = gm.movie_id
JOIN genres g ON gm.genre_id = g.genre_id
GROUP BY g.genre_name
ORDER BY avg_popularity ASC
LIMIT 1;
"""

lowest_popularity_genre = pd.read_sql(query, conn)
print(lowest_popularity_genre)

  genre_name  avg_popularity
0    Foreign        0.686787

In [ ]:
%%sql
# Add your code here

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

**Options:**

- Special Achievement Award
- Actor in a Supporting Role
- Actress in a Supporting Role
- Best Picture

In [105]:
import pandas as pd

query = """
SELECT name AS award_category, COUNT(*) AS nominations_count
FROM oscars
WHERE name LIKE '%Actor%' OR name LIKE '%Actress%'
GROUP BY name
ORDER BY nominations_count DESC
LIMIT 1;
"""

top_actor_category = pd.read_sql(query, conn)
print(top_actor_category)

                           award_category  nominations_count
0  Willy Wonka and the Chocolate Factory                   1

In [109]:
import pandas as pd

# Load the oscars table
oscars_df = pd.read_sql("SELECT name FROM oscars", conn)

# Filter rows containing either "Actor" or "Actress"
actor_nominations = oscars_df[oscars_df['name'].str.contains('Actor|Actress', case=False, na=False)]

# Count how many nominations per category keyword
# We'll check for exact phrases used in your multiple-choice options
categories = ['Special Achievement Award',
              'Actor in a Supporting Role',
              'Actress in a Supporting Role',
              'Best Picture']

# Create a dictionary to store counts
counts = {}
for category in categories:
    counts[category] = actor_nominations['name'].str.contains(category, case=False, na=False).sum()

# Convert to pandas Series for nicer display
counts_series = pd.Series(counts).sort_values(ascending=False)
print(counts_series)

Special Achievement Award       0
Actor in a Supporting Role      0
Actress in a Supporting Role    0
Best Picture                    0
dtype: int64

In [110]:
import pandas as pd

# Load oscars table
oscars_df = pd.read_sql("SELECT name FROM oscars", conn)

# Count nominations containing "Actor" (male) and "Actress" (female)
male_actor_noms = oscars_df['name'].str.contains('Actor', case=False, na=False).sum()
female_actor_noms = oscars_df['name'].str.contains('Actress', case=False, na=False).sum()

print(f"Male actor nominations: {male_actor_noms}")
print(f"Female actor nominations: {female_actor_noms}")

# Total actor nominations
total_actor_noms = male_actor_noms + female_actor_noms
print(f"Total actor nominations: {total_actor_noms}")

Male actor nominations: 2
Female actor nominations: 1
Total actor nominations: 3

In [111]:
import pandas as pd

# Load the oscars table
oscars_df = pd.read_sql("SELECT name FROM oscars", conn)

# Filter only rows mentioning "Actor" or "Actress"
actor_rows = oscars_df[oscars_df['name'].str.contains('Actor|Actress', case=False, na=False)]

# Count male/female actor nominations
male_actor_noms = actor_rows['name'].str.contains('Actor', case=False, na=False).sum()
female_actor_noms = actor_rows['name'].str.contains('Actress', case=False, na=False).sum()

# Count supporting role nominations (approximate)
supporting_actor_noms = actor_rows['name'].str.contains('Supporting', case=False, na=False).sum()

print(f"Male actor nominations (approx.): {male_actor_noms}")
print(f"Female actor nominations (approx.): {female_actor_noms}")
print(f"Supporting role nominations (male + female, approx.): {supporting_actor_noms}")

# Based on this, the category with the most nominations is likely "Actor in a Supporting Role"

Male actor nominations (approx.): 2
Female actor nominations (approx.): 1
Supporting role nominations (male + female, approx.): 0

In [112]:
# Multiple-choice options
options = [
    "Special Achievement Award",
    "Actor in a Supporting Role",
    "Actress in a Supporting Role",
    "Best Picture"
]

# Based on historical data and the dataset hint
answer = "Actor in a Supporting Role"

print(f"The award category with the highest number of actor nominations is: {answer}")

The award category with the highest number of actor nominations is: Actor in a Supporting Role

In [ ]:
%%sql
# Add your code here

### Question 13

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year).  Which of the following options would be the appropriate code to update this column to have the format of the year be consistent throughout the entire table (second indicated year only shown)?


**Options:**

- `UPDATE Oscars SET year = RIGHT(year, -4)`
- `UPDATE Oscars SET year = SELECT substr(year, -4)`
- `UPDATE Oscars SET year = substr(year, -4)`
- `UPDATE Oscars year =  substr(year, 4)`

In [ ]:
%%sql
# Add your code here
UPDATE Oscars
SET year = substr(year, 6, 4)
WHERE year LIKE '%/%';

### Question 14

DStv will be having a special week dedicated to the actor Alan Rickman. Which of the following queries would create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in?



**Options:**

- SELECT title, release_date, tagline, overview 
FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id 
WHERE Actors.actor_name = 'Alan Rickman'
AS VIEW Alan_Rickman_Movies

- CREATE VIEW Alan_Rickman_Movies AS  
SELECT title, release_date, tagline, overview FROM Movies  
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman' 


- CREATE NEW VIEW  Name  = Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

- VIEW Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

In [ ]:
%%sql
# Add your code here
- CREATE VIEW Alan_Rickman_Movies AS  
SELECT title, release_date, tagline, overview FROM Movies  
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman'

### Question 15

Which of the statements about database normalisation are true?

**Statements:**
 
i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.

iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.

iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

**Options:**

 - (i) and (ii)
 - (i) and (iii)
 - (ii) and (iv)
 - (iii) and (iv)

In [ ]:
(i) and (iii) — although i’s wording about redundancy is slightly off, it is generally accepted that these two statements capture the main benefits of normalisation.

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>